In [4]:
import pandas as pd

In [2]:
import sqlalchemy as alch
from getpass import getpass

password = getpass()
dbName = "sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

### 1. Calculate the average rental duration (in days) for each film:

In [26]:
# query = '''
#         select title, rental_duration, avg(rental_duration) over() as avg_rental_duration from film
# 	        order by avg_rental_duration desc;
#         '''

query = '''
        select title, rental_duration, avg(datediff(date(r.return_date), date(r.rental_date))) as avg_rental_duration
        from film as f
                join inventory as i on f.film_id = i.film_id
                join rental as r on i.inventory_id = r.inventory_id
		group by f.title, f.rental_duration
	        order by avg_rental_duration desc;
        '''

pd.read_sql_query(query, engine)

                   title  rental_duration  avg_rental_duration
0            AFRICAN EGG                6               7.0909
1            FLIGHT LIES                7               7.0833
2         HARDLY ROBBERS                7               7.0000
3         IMPACT ALADDIN                6               7.0000
4             WAGON JAWS                7               6.9000
..                   ...              ...                  ...
953    COMANCHEROS ENEMY                5               3.0000
954    FREEDOM CLEOPATRA                5               2.8000
955    STALLION SUNDANCE                5               2.7143
956  JAWBREAKER BROOKLYN                5               2.7000
957    DUFFEL APOCALYPSE                5               1.7143

[958 rows x 3 columns]

#### Expected output

|title|rental_duration|avg_rental_duration|
|-----|---------------|-------------------|
|ACADEMY DINOSAUR|6              |4.9850             |
|ACE GOLDFINGER|3              |4.9850             |
|ADAPTATION HOLES|7              |4.9850             |
|AFFAIR PREJUDICE|5              |4.9850             |
|AFRICAN EGG|6              |4.9850             |
|AGENT TRUMAN|3              |4.9850             |
|AIRPLANE SIERRA|6              |4.9850             |
|AIRPORT POLLOCK|6              |4.9850             |
|ALABAMA DEVIL|3              |4.9850             |
|ALADDIN CALENDAR|6              |4.9850             |
|ALAMO VIDEOTAPE|6              |4.9850             |
|ALASKA PHANTOM|6              |4.9850             |
|ALI FOREVER|4              |4.9850             |
|ALICE FANTASIA|6              |4.9850             |

###  2. Calculate the average payment amount for each staff member:

In [29]:
query = '''
        select staff_id, avg(amount) as avg_payment_amount
        from payment
        group by staff_id;
        '''

pd.read_sql_query(query, engine)

   staff_id  avg_payment_amount
0         1            4.156568
1         2            4.245125

#### Expected output

|staff_id|avg_payment_amount|
|--------|------------------|
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |

### 3. Calculate the total revenue for each customer, showing the running total within each customer's rental history:

In [32]:
query = '''
        select p.customer_id, r.rental_id, r.rental_date, p.amount, sum(amount) over (partition by p.customer_id order by r.rental_date) as running_total
        from payment as p
            join rental as r on p.rental_id = r.rental_id;
        '''
pd.read_sql_query(query, engine)

       customer_id  rental_id         rental_date  amount  running_total
0                1         76 2005-05-25 11:30:37    2.99           2.99
1                1        573 2005-05-28 10:35:23    0.99           3.98
2                1       1185 2005-06-15 00:54:12    5.99           9.97
3                1       1422 2005-06-15 18:02:53    0.99          10.96
4                1       1476 2005-06-15 21:08:46    9.99          20.95
...            ...        ...                 ...     ...            ...
16039          599      14599 2005-08-21 17:43:42    4.99          66.85
16040          599      14719 2005-08-21 21:41:57    1.99          68.84
16041          599      15590 2005-08-23 06:09:44    8.99          77.83
16042          599      15719 2005-08-23 11:08:46    2.99          80.82
16043          599      15725 2005-08-23 11:25:00    2.99          83.81

[16044 rows x 5 columns]

#### Expected output

|customer_id|rental_id|rental_date        |amount|running_total|
|-----------|---------|-------------------|------|-------------|
|1          |76       |2005-05-25 11:30:37|2.99  |2.99         |
|1          |573      |2005-05-28 10:35:23|0.99  |3.98         |
|1          |1185     |2005-06-15 00:54:12|5.99  |9.97         |
|1          |1422     |2005-06-15 18:02:53|0.99  |10.96        |
|1          |1476     |2005-06-15 21:08:46|9.99  |20.95        |
|1          |1725     |2005-06-16 15:18:57|4.99  |25.94        |
|1          |2308     |2005-06-18 08:41:48|4.99  |30.93        |
|1          |2363     |2005-06-18 13:33:59|0.99  |31.92        |
|1          |3284     |2005-06-21 06:24:45|3.99  |35.91        |
|1          |4526     |2005-07-08 03:17:05|5.99  |41.90        |

### 4. Determine the quartile for the rental rates of films:

In [35]:
query = '''
        select title, rental_rate, ntile(4) over (partition by rental_rate) as quartile from film;
        '''
pd.read_sql_query(query, engine)

                    title  rental_rate  quartile
0        ACADEMY DINOSAUR         0.99         1
1         ALAMO VIDEOTAPE         0.99         1
2          ALASKA PHANTOM         0.99         1
3          ALICE FANTASIA         0.99         1
4              ALONE TRIP         0.99         1
..                    ...          ...       ...
995  WONDERLAND CHRISTMAS         4.99         4
996   WORKING MICROCOSMOS         4.99         4
997         WYOMING STORM         4.99         4
998           YENTL IDAHO         4.99         4
999             ZORRO ARK         4.99         4

[1000 rows x 3 columns]

#### Expected output

|title|rental_rate|quartile           |
|-----|-----------|-------------------|
|ACADEMY DINOSAUR|0.99       |1                  |
|ALAMO VIDEOTAPE|0.99       |1                  |
|ALASKA PHANTOM|0.99       |1                  |
|ALICE FANTASIA|0.99       |1                  |
|ALONE TRIP|0.99       |1                  |
|ALTER VICTORY|0.99       |1                  |
|AMADEUS HOLY|0.99       |1                  |
|ANACONDA CONFESSIONS|0.99       |1                  |
|ANNIE IDENTITY|0.99       |1                  |
|ANONYMOUS HUMAN|0.99       |1                  |

### 5. Determine the first and last rental date for each customer:

In [40]:
query = '''
        select customer_id, 
            min(rental_date) as first_rental_date,
            max(rental_date) as last_rental_date from rental
            group by customer_id;
        '''
pd.read_sql_query(query, engine)

     customer_id   first_rental_date    last_rental_date
0              1 2005-05-25 11:30:37 2005-08-22 20:03:46
1              2 2005-05-27 00:09:24 2005-08-23 17:39:35
2              3 2005-05-27 17:17:09 2005-08-23 07:10:14
3              4 2005-06-15 09:31:28 2005-08-23 07:43:00
4              5 2005-05-29 07:25:16 2006-02-14 15:16:03
..           ...                 ...                 ...
594          595 2005-05-28 15:27:22 2005-08-23 21:26:35
595          596 2005-05-26 21:16:52 2006-02-14 15:16:03
596          597 2005-05-25 04:19:28 2006-02-14 15:16:03
597          598 2005-06-20 10:10:29 2005-08-23 00:44:15
598          599 2005-05-31 01:18:56 2005-08-23 11:25:00

[599 rows x 3 columns]

#### Expected result

|customer_id|first_rental_date|last_rental_date   |
|-----------|-----------------|-------------------|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|

### 6. Calculate the rank of customers based on their rental counts:

In [44]:
query = '''
        select customer_id, count(rental_id) as rental_count, rank() over (order by count(rental_id) desc)  as rental_count_rank
        from rental
        group by customer_id
        order by rental_count_rank;
        '''
pd.read_sql_query(query, engine)

     customer_id  rental_count  rental_count_rank
0            148            46                  1
1            526            45                  2
2            144            42                  3
3            236            42                  3
4             75            41                  5
..           ...           ...                ...
594          248            15                594
595           61            14                596
596          110            14                596
597          281            14                596
598          318            12                599

[599 rows x 3 columns]

#### Expected output

|customer_id|rental_count                 |rental_count_rank|
|-----------|-----------------------------|-----------------|
|148        |46                           |1                |
|526        |45                           |2                |
|144        |42                           |3                |
|236        |42                           |3                |
|75         |41                           |5                |
|197        |40                           |6                |
...|...|...

### 7. Calculate the running total of revenue per day for the 'G' film category:

In [55]:
query = '''
        select f.title, r.rental_date, p.amount, sum(p.amount) over (partition by r.rental_date) as daily_revenue
        from category as c
            join film_category as fc on c.category_id = fc.category_id
            join film as f on fc.film_id = f.film_id
            join inventory as i on f.film_id = i.film_id
            join rental as r on i.inventory_id = r.inventory_id
            join payment as p on r.rental_id = p.rental_id
            where c.name = 'Family'
            order by rental_date;
        '''

# query = '''
#         select * from film as f
#             join film_category as fc on f.film_id = fc.film_id
#             join category as c on fc.category_id = c.category_id
#             where c.name = 'Family';
#         '''
pd.read_sql_query(query, engine)

                   title         rental_date  amount  daily_revenue
0        BLANKET BEVERLY 2005-05-24 22:53:30    2.99           2.99
1         KING EVOLUTION 2005-05-25 00:22:55    6.99           6.99
2          APACHE DIVINE 2005-05-25 01:59:46    4.99           4.99
3     MANCHURIAN CURTAIN 2005-05-25 04:47:44    4.99           4.99
4            GANDHI KWAI 2005-05-25 13:52:43    0.99           0.99
...                  ...                 ...     ...            ...
1091       HALF OUTFIELD 2006-02-14 15:16:03    2.99          29.90
1092       HALF OUTFIELD 2006-02-14 15:16:03    0.00          29.90
1093          JASON TRAP 2006-02-14 15:16:03    2.99          29.90
1094   MOVIE SHAKESPEARE 2006-02-14 15:16:03    0.00          29.90
1095   OPPOSITE NECKLACE 2006-02-14 15:16:03    4.99          29.90

[1096 rows x 4 columns]

#### Expected ouput

|film_category|rental_date                  |amount|daily_revenue|
|-------------|-----------------------------|------|-------------|
|BLANKET BEVERLY|2005-05-24 22:53:30          |2.99  |2.99         |
|GRADUATE LORD|2005-05-24 23:03:39          |3.99  |3.99         |
|LAWLESS VISION|2005-05-24 23:31:46          |4.99  |4.99         |
|HANGING DEEP |2005-05-25 00:02:21          |5.99  |5.99         |
|MONTEREY LABYRINTH|2005-05-25 00:31:15          |0.99  |0.99         |
|SCISSORHANDS SLUMS|2005-05-25 01:48:41          |2.99  |2.99         |
|EASY GLADIATOR|2005-05-25 03:41:50          |4.99  |4.99         |

### 8. Assign a unique ID to each payment within each customer's payment history:

In [64]:
query = '''
        select customer_id, payment_id, row_number() over (partition by customer_id order by payment_id) as payment_sequence_id from payment;
        '''
pd.read_sql_query(query, engine)

       customer_id  payment_id  payment_sequence_id
0                1           1                    1
1                1           2                    2
2                1           3                    3
3                1           4                    4
4                1           5                    5
...            ...         ...                  ...
16044          599       16045                   15
16045          599       16046                   16
16046          599       16047                   17
16047          599       16048                   18
16048          599       16049                   19

[16049 rows x 3 columns]

|customer_id|payment_id|payment_sequence_id|
|-----------|----------|-------------------|
|1          |1         |1                  |
|1          |2         |2                  |
|1          |3         |3                  |
|1          |4         |4                  |
|1          |5         |5                  |
|1          |6         |6                  |
|1          |7         |7                  |
|1          |8         |8                  |
|1          |9         |9                  |
|1          |10        |10                 |
|1          |11        |11                 |
|1          |12        |12                 |
|1          |13        |13                 |
|1          |14        |14                 |
|1          |15        |15                 |
|1          |16        |16                 |
|1          |17        |17                 |
|1          |18        |18                 |
|1          |19        |19                 |
|1          |20        |20                 |
|1          |21        |21                 |
|1          |22        |22                 |
|1          |23        |23                 |
|1          |24        |24                 |
|1          |25        |25                 |
|1          |26        |26                 |
|1          |27        |27                 |
|1          |28        |28                 |
|1          |29        |29                 |
|1          |30        |30                 |
|1          |31        |31                 |
|1          |32        |32                 |
|2          |33        |1                  |
|2          |34        |2                  |
|2          |35        |3                  |
|2          |36        |4                  |
|2          |37        |5                  |
|2          |38        |6                  |
|2          |39        |7                  |
|2          |40        |8                  |
|2          |41        |9                  |
|2          |42        |10                 |
|2          |43        |11                 |
|2          |44        |12                 |

### 9. Calculate the difference in days between each rental and the previous rental for each customer:

In [65]:
query = '''
        select customer_id, rental_id, rental_date, lag(rental_date) over (partition by customer_id order by rental_date) as previous_rental_date, 
        datediff(rental_date, lag(rental_date) over (partition by customer_id order by rental_date)) as days_between_rentals
        from rental;
        '''
pd.read_sql_query(query, engine)

,customer_id,rental_id,rental_date,previous_rental_date,days_between_rentals
0,1,76,2005-05-25 11:30:37,NaT,NaN
1,1,573,2005-05-28 10:35:23,2005-05-25 11:30:37,3.0
2,1,1185,2005-06-15 00:54:12,2005-05-28 10:35:23,18.0
3,1,1422,2005-06-15 18:02:53,2005-06-15 00:54:12,0.0
4,1,1476,2005-06-15 21:08:46,2005-06-15 18:02:53,0.0
...,...,...,...,...,...
16039,599,14599,2005-08-21 17:43:42,2005-08-21 05:07:08,0.0
16040,599,14719,2005-08-21 21:41:57,2005-08-21 17:43:42,0.0
16041,599,15590,2005-08-23 06:09:44,2005-08-21 21:41:57,2.0
16042,599,15719,2005-08-23 11:08:46,2005-08-23 06:09:44,0.0
16043,599,15725,2005-08-23 11:25:00,2005-08-23 11:08:46,0.0

#### Expected output


|customer_id|rental_id|rental_date        |previous_rental_date|days_between_rentals|
|-----------|---------|-------------------|--------------------|--------------------|
|1          |76       |2005-05-25 11:30:37|NULL                |NULL                |
|1          |573      |2005-05-28 10:35:23|2005-05-25 11:30:37 |3                   |
|1          |1185     |2005-06-15 00:54:12|2005-05-28 10:35:23 |18                  |
|1          |1422     |2005-06-15 18:02:53|2005-06-15 00:54:12 |0                   |
|1          |1476     |2005-06-15 21:08:46|2005-06-15 18:02:53 |0                   |
|1          |1725     |2005-06-16 15:18:57|2005-06-15 21:08:46 |1                   |
|1          |2308     |2005-06-18 08:41:48|2005-06-16 15:18:57 |2                   |
|1          |2363     |2005-06-18 13:33:59|2005-06-18 08:41:48 |0                   |
|1          |3284     |2005-06-21 06:24:45|2005-06-18 13:33:59 |3                   |
|1          |4526     |2005-07-08 03:17:05|2005-06-21 06:24:45 |17                  |
|1          |4611     |2005-07-08 07:33:56|2005-07-08 03:17:05 |0                   |